<?php

$country = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Республика Татарстан' => ['Казань', 'Свияжск', 'Набережные челны', 'Черемшан'],
    'Чувашская Республика' => ['Чебоксары', 'Канаш', 'Алатырь', 'Шумерля']
];

foreach ($country as $region => $cities) {
    foreach ($cities as $city) {
        if (mb_substr($city,0,1) == 'К')
        echo $city;
    }
    echo "\n";
}
