<?php

$country = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Республика Татарстан' => ['Казань', 'Свияжск', 'Набережные челны', 'Черемшан'],
    'Чувашская Республика' => ['Чебоксары', 'Канаш', 'Алатырь', 'Шумерля']
];

foreach ($country as $region => $cities) {
    echo $region . " : ";
    foreach ($cities as $city) {
        echo $city;
        if ($city != end($cities)) {
            echo ", ";
        }
    }
    echo "\n";
}

